app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "t5TyainQXJeLxZA9ifZPkA"], ["updated_at", "2020-04-13 04:41:16.623625"], ["id", 30]]
---
    def reset_session_token!
        self.update!(session_token: User.generate_session_token)